<a href="https://colab.research.google.com/github/allanstar-byte/IP_WEEK_3/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2020_11_ALLAN_NGOMA_PythonNotebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **1. Importing the Libraries to be used**

In [ ]:
# importing pandas library

import pandas as pd
# as well as the Numpy library
import numpy as np

# **2. Loading our Datasets**

In [ ]:
# importing CDR_Description.xls dataset
df1 = pd.read_excel('/content/CDR_description.xlsx') 
df1

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
#importing telcom_dataset.csv
df2 = pd.read_csv('/content/Telcom_dataset.csv') 
df2.head()

  PRODUTC  VALUE DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0   04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0   05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25   05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56   05:42.0  ...     19e2e      #NAME?      #NAME?
4   Voice     14   06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#importing telcom_dataset2.csv
df3 = pd.read_csv('/content/Telcom_dataset2.csv') 
df3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
#importing telcom_dataset3.csv
df4 = pd.read_csv('/content/Telcom_dataset3.csv') 
df4.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
#importing cells_geo.csv
#seperating using the delimeter (;)
df5 = pd.read_csv('/content/cells_geo.csv',sep=';') 
df5.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [ ]:
#importing cells_geo_description.xls
df6 = pd.read_excel('/content/cells_geo_description.xlsx') 
df6

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

# **3. Data Understanding and Exploration**

In [44]:
#displaying different data types of the columns
df2.dtypes

PRODUCT            object
VALUE               int64
TIME               object
CELL_ON_SITE       object
DW_A_NUMBER_INT    object
DW_B_NUMBER_INT    object
COUNTRY_A          object
COUNTRY_B          object
CELL_ID            object
SITE_ID            object
dtype: object

In [45]:
df3.dtypes

PRODUCT            object
VALUE               int64
DATE_TIME          object
CELL_ON_SITE       object
DW_A_NUMBER_INT    object
DW_B_NUMBER_INT    object
COUNTRY_A          object
COUNTRY_B          object
CELL_ID            object
SITE_ID            object
dtype: object

In [46]:
df4.dtypes

PRODUCT            object
VALUE               int64
DATE_TIME          object
CELL_ON_SITE       object
DW_A_NUMBER_INT    object
DW_B_NUMBER_INT    object
COUNTRY_A          object
COUNTRY_B          object
CELL_ID            object
SITE_ID            object
dtype: object

In [47]:
df5.dtypes

Unnamed: 0        int64
CITY             object
STATUS           object
LOCALISATION     object
DECOUPZONE       object
ZONENAME         object
LONGITUDE       float64
LATITUDE        float64
REGION           object
AREA             object
CELL_ID          object
SITE_ID          object
dtype: object

In [48]:
#identifying the precence of null values in the  datasets
df2.isna().sum()

PRODUCT              0
VALUE                0
TIME                 0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELL_ID              0
SITE_ID            716
dtype: int64

In [49]:
df3.isna().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELL_ID              0
SITE_ID            676
dtype: int64

In [50]:
df4.isna().sum()

PRODUCT              0
VALUE                0
DATE_TIME            0
CELL_ON_SITE         0
DW_A_NUMBER_INT      0
DW_B_NUMBER_INT      0
COUNTRY_A            0
COUNTRY_B            0
CELL_ID              0
SITE_ID            605
dtype: int64

In [51]:
df5.isna().sum()

Unnamed: 0       0
CITY             0
STATUS          67
LOCALISATION     0
DECOUPZONE       0
ZONENAME         6
LONGITUDE        0
LATITUDE         0
REGION           0
AREA            23
CELL_ID          0
SITE_ID          0
dtype: int64

In [52]:
#identifying the precence of duplicates values in the dataset
df2.duplicated().sum()

82

In [53]:
df3.duplicated().sum()

78

In [54]:
df4.duplicated().sum()

93

In [55]:
df5.duplicated().sum()

0

# **4. Data Preparation**

**4.1 Renaming columns**

In [ ]:
#Renaming columns in Telcom_dataset.csv
#Renaming the column PRODUTC to PRODUCT
df2.rename(columns = {'PRODUTC':'PRODUCT'}, inplace = True)
df2
#Renaming the column DATETIME to TIME
df2.rename(columns = {'DATE_TIME':'TIME'}, inplace = True)
df2.head(2)

  PRODUCT  VALUE     TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [ ]:
#Renaming columns in Telcom_dataset2.csv
#Renaming the column DW_A_NUMBER to DW_A_NUMBER_INT
df3.rename(columns = {'DW_A_NUMBER':'DW_A_NUMBER_INT'}, inplace = True)
df3
#Renaming the column DW_B_NUMBER to DW_B_NUMBER_INT
df3.rename(columns = {'DW_B_NUMBER':'DW_B_NUMBER_INT'}, inplace = True)
df3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q

[3 rows x 10 columns]

In [ ]:
#Renaming columns in Telcom_dataset3.csv
#Renaming the column SIET_ID to SITE_ID
df4.rename(columns = {'SIET_ID':'SITE_ID'}, inplace = True)
df4.head(3)
#Renaming the column CELLID to CELL_ID
df4.rename(columns = {'CELLID':'CELL_ID'}, inplace = True)
df4.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [ ]:
#renaming the SITE_CODE to SITE_ID the cells_geo.csv dataset
df5.rename(columns = {'SITE_CODE':'SITE_ID'}, inplace = True)

#renaming the VILLES to CITY the cells_geo.csv dataset
df5.rename(columns = {'VILLES':'CITY'}, inplace = True)
df5.head(3)

   Unnamed: 0    CITY      STATUS  ... AREA     CELL_ID     SITE_ID
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2  ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17

[3 rows x 12 columns]

**4.2 splitting date and time**

In [67]:
#splitting date and and column in Telcom_dataset2.csv
df60 = df3['DATE_TIME'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split(' '))]))
df60.columns = ['TIME', 'DATE']
df60
#merging to the original dataset
df70 = df60.merge(df3, left_index=True, right_index=True)
df70
#droping DATE_TIME column
df80 = df70.drop('DATE_TIME', axis=1)
df80.head()

         TIME        DATE PRODUCT  ...  COUNTRY_B     CELL_ID     SITE_ID
0  23:02:06.0  2012-05-07     sms  ...      19e2e  +854AcBQT2  +854AcBQT2
1  23:03:44.0  2012-05-07   Voice  ...      19e2e  +854AcBQT2  +854AcBQT2
2  23:04:06.0  2012-05-07     sms  ...      19e2e  +laSrk7g6q  +laSrk7g6q
3  23:04:48.0  2012-05-07   Voice  ...      19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4  23:04:58.0  2012-05-07     sms  ...      19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 11 columns]

In [74]:
#removing duplicated values
df80.drop_duplicates(inplace=True)
df80.duplicated().sum()

0

In [ ]:
#splitting date and and column in Telcom_dataset3.csv
df90 = df4['DATE_TIME'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split(' '))]))
df90.columns = ['TIME', 'DATE']
df90
#merging to the original dataset
df91 = df60.merge(df4, left_index=True, right_index=True)
df91
#droping DATE_TIME column
df100 = df91.drop('DATE_TIME', axis=1)
df100.head()

         TIME        DATE PRODUCT  ...  COUNTRY_B     CELL_ID     SITE_ID
0  23:02:06.0  2012-05-07   Voice  ...      19e2e  +38u2u/rfx  +38u2u/rfx
1  23:03:44.0  2012-05-07     sms  ...      19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2  23:04:06.0  2012-05-07   Voice  ...      19e2e  +ZaaZozy/+  +ZaaZozy/+
3  23:04:48.0  2012-05-07     sms  ...      19e2e  +cNeJzsTp3  +cNeJzsTp3
4  23:04:58.0  2012-05-07   Voice  ...      19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 11 columns]

In [75]:
#removing duplicated values
df100.drop_duplicates(inplace=True)
df100.duplicated().sum()

0

In [77]:
#removing duplicated values on Telcom_dataset.csv
df2.drop_duplicates(inplace=True)
df2.duplicated().sum()

0

**4.3 Merging datasets**

In [78]:
#merging telcom_dataset.csv, telcom_dataset2.csv using append since they are similar
df6 = df80.append([df100, df2])
df6
#merging the telcom_dataset.csv, telcom_dataset2.csv appended dataset with the Cells_geo.csv dataset
df7 = df5.merge(df6, left_index=True, right_index=True)
df7.head()

   Unnamed: 0    CITY      STATUS  ... COUNTRY_B   CELL_ID_y   SITE_ID_y
0           0  ADJAME  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
0           0  ADJAME  In Service  ...     19e2e  +38u2u/rfx  +38u2u/rfx
0           0  ADJAME  In Service  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1           1  ADJAME  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
1           1  ADJAME  In Service  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx

[5 rows x 23 columns]

 **4.4 Dropping null values**

In [79]:
#dropping the null values
df8 = df7.dropna()
df8.isna().sum()

Unnamed: 0         0
CITY               0
STATUS             0
LOCALISATION       0
DECOUPZONE         0
ZONENAME           0
LONGITUDE          0
LATITUDE           0
REGION             0
AREA               0
CELL_ID_x          0
SITE_ID_x          0
TIME               0
DATE               0
PRODUCT            0
VALUE              0
CELL_ON_SITE       0
DW_A_NUMBER_INT    0
DW_B_NUMBER_INT    0
COUNTRY_A          0
COUNTRY_B          0
CELL_ID_y          0
SITE_ID_y          0
dtype: int64

In [80]:
#merged datased shape after dropping duplicated and null values
df8.shape

(6717, 23)

# **5. Analysis**

i will analyse the merged and cleaned dataset by answering different questions as follows:

In [81]:
df8.head()

    Unnamed: 0   CITY      STATUS  ... COUNTRY_B   CELL_ID_y   SITE_ID_y
23          23  ABOBO  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
23          23  ABOBO  In Service  ...     19e2e  2q0YsSCxbH  2q0YsSCxbH
24          24  ABOBO  In Service  ...     19e2e  +e+xcimwre  +e+xcimwre
24          24  ABOBO  In Service  ...     19e2e  1MTLUFpdzd  1MTLUFpdzd
25          25  ABOBO  In Service  ...     19e2e  +pZNtCvhmT  +pZNtCvhmT

[5 rows x 23 columns]

In [121]:
#1. Which ones were the most used city for the three days?
df40 =df8['DATE'].groupby(df8['CITY'])
df40.sum()

CITY
ABENGOUROU       2012-05-072012-05-072012-05-072012-05-072012-0...
ABOBO            2012-05-072012-05-072012-05-072012-05-072012-0...
ABOISSO          2012-05-072012-05-072012-05-072012-05-072012-0...
ABOISSO COMOE    2012-05-072012-05-072012-05-072012-05-072012-0...
ABONGOUA         2012-05-072012-05-072012-05-072012-05-072012-0...
                                       ...
ZATTA                               2012-05-082012-05-082012-05-08
ZIKISSO          2012-05-082012-05-082012-05-082012-05-082012-0...
ZON-HOUNIEN      2012-05-082012-05-082012-05-082012-05-082012-0...
ZOUKOUGBEU                2012-05-082012-05-082012-05-082012-05-08
ZUENOULA         2012-05-082012-05-082012-05-082012-05-082012-0...
Name: DATE, Length: 492, dtype: object

In [83]:
#2. Which cities were the most used during business and home hour
z = df8.groupby(['CITY', 'TIME', 'REGION']).sum().reset_index()
z.sort_values('TIME', ascending=0).head(10)

           CITY        TIME        REGION  ...  LONGITUDE   LATITUDE  VALUE
1056    PLATEAU  23:59:56.0        LAGUNE  ...  -4.024028   5.334806      0
1055    PLATEAU  23:59:55.0        LAGUNE  ...  -4.024028   5.334806      0
944     MARCORY  23:59:51.0        LAGUNE  ...  -3.959028   5.282750      0
943     MARCORY  23:59:50.0        LAGUNE  ...  -3.959028   5.282750     50
942     MARCORY  23:59:48.0        LAGUNE  ...  -3.959028   5.282750      0
941     MARCORY  23:59:40.0        LAGUNE  ...  -3.959028   5.282750      0
506    BIANOUAN  23:59:38.0   MOYEN COMOE  ... -12.728889  24.063667    101
505    BIANOUAN  23:59:35.0   MOYEN COMOE  ...  -6.364444  12.031833     45
504   BIANKOUMA  23:59:27.0  18 MONTAGNES  ... -15.221444  15.492278    122
503   BIANKOUMA  23:59:23.0  18 MONTAGNES  ... -15.221444  15.492278    480

[10 rows x 7 columns]

In [105]:
#3. Most used city for the three days?
test1 = df8['CITY'].groupby(df8['DATE'])
test1.sum()

DATE
2012-05-07    ABOBOABOBOABOBOABOBOABOBOABOBOABOBOABOBOABOBOA...
2012-05-08    PLATEAUPLATEAUPLATEAUPLATEAUPLATEAUPLATEAUPLAT...
Name: CITY, dtype: object

In [107]:
#4. The most used zone
df45 = df8[('ZONENAME')].value_counts()
df45.head(1)

ZONE A - Grand-NORD    878
Name: ZONENAME, dtype: int64

In [109]:
#5. The most used Region
df41 = df8[('REGION')].value_counts()
df41.head()

LAGUNE               3200
BAS SASSANDRA         414
VALLEE DU BANDAMA     284
LACS                  279
HAUT SASSANDRA        257
Name: REGION, dtype: int64

In [87]:
#6. The most used product
df42 = df8[('PRODUCT')].value_counts()
df42.head()

sms      3986
Voice    2563
data      168
Name: PRODUCT, dtype: int64

In [112]:
#7. finding the most used product in each region
l = df8.groupby(['PRODUCT', 'REGION']).sum().reset_index()
l.sort_values('REGION', ascending=0).head(10).max()

PRODUCT           sms
REGION         ZANZAN
Unnamed: 0     260114
LONGITUDE    -6.61533
LATITUDE      1345.22
VALUE            5910
dtype: object

In [90]:
#8. describing the product column
df8['PRODUCT'].describe()

count     6717
unique       3
top        sms
freq      3986
Name: PRODUCT, dtype: object

In [91]:
#9. describing the STATUS column
df8['STATUS'].describe()

count           6717
unique             1
top       In Service
freq            6717
Name: STATUS, dtype: object

In [93]:
#10. General descriptive statistics
df8.describe()

        Unnamed: 0    LONGITUDE     LATITUDE        VALUE
count  6717.000000  6717.000000  6717.000000  6717.000000
mean   1954.451987    -4.848680     6.219274    27.263808
std    1160.947796     1.282368     1.290844   132.464970
min      23.000000    -8.503889     0.000000     0.000000
25%     900.000000    -5.748333     5.338500     0.000000
50%    1955.000000    -4.076972     5.450278     0.000000
75%    2958.000000    -3.992278     6.843278    25.000000
max    3973.000000    -0.000000    10.481861  6750.000000

In [94]:
#11. longitute and latitude skewness
df8.skew()

Unnamed: 0     0.022633
LONGITUDE     -0.765189
LATITUDE       1.092626
VALUE         29.371230
dtype: float64

In [95]:
#12. correlation matrix of the longitute and latitude
df8.corr()

            Unnamed: 0  LONGITUDE  LATITUDE     VALUE
Unnamed: 0    1.000000  -0.167723  0.054117  0.011009
LONGITUDE    -0.167723   1.000000 -0.467350  0.014461
LATITUDE      0.054117  -0.467350  1.000000 -0.018490
VALUE         0.011009   0.014461 -0.018490  1.000000